t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F3xx_DFP</name>
  <description>STMicroelectronics STM32F3 Series Device Support and Examples</description>

  <releases>
    <release version="1.3.0" date="2015-03-02">
      Added devices: STM32F302xE, STM32F302xD, STM32F303xE, STM32F303xD.
      Added device STM32F398VE.
      Added device feature description.
      Updated device support files.
      Updated reference manuals, datasheets, errata sheets.
      Reworked 'Conditions', 'Component Startup'.
    </release>
    <release version="1.2.0" date="2014-11-18">
      Fixed device define for STM32F301 devices from "STM32F301x8" to "STM32F302x8"
      Updated STM32373C-EVAL GLCD board support files.
      Updated STM32373C-EVAL board description.
    </release>
    <release version="1.1.0" date="2014-10-01">
      Device Support for STM32F301, STM32F302, STM32F303, STM32F3x4, STM32F3x8 and STM32F373 Device Subfamilies
      - based on STM32F30x_DSP_StdPeriph_Lib_V1.2.0 and STM32F37x_DSP_StdPeriph_Lib_V1.0.0
      Added: Board description, Board support for
      - STMicroelectronics STM32F3-Discovery, STM32373C-EVAL and STM32303C-EVAL
    </release>
    <release version="1.0.1">
      Updated: Device descriptions updated with features
    </release>
    <release version="1.0.0">
      First Release version of STM32F3 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F3</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F3 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <book name="Documents\dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
STMicroelectronics' STM32F3 family offers an extensive range of enhanced I/Os and peripherals connected to two APB buses.

  - SRAM with HW parity checking
  - Timer with quadrature (incremental) encoder input
  - Timer with deadtime generation and emergency stop
  - 5 V-tolerant I/Os
  - Rail-to-rail analog comparators
  - Operational amplifiers
  - 96-bit unique ID
      </description>

      <!-- ************************  Subfamily 'STM32F301'  **************************** -->
      <subFamily DsubFamily="STM32F301">
        <processor Dclock="72000000"/>

        <book name="Documents\DM00094350.pdf" title="STM32F301x6/8 and STM32F318x8 Reference Manual"/>
        <book name="Documents\DM00093332.pdf" title="STM32F301x6 STM32F301x8 Dataheet"/>
        <book name="Documents\DM00104412.pdf" title="STM32F301x6 STM32F301x8 Errata Sheet"/>

        <!-- *************************  Device 'STM32F301C6'  ************************** -->
        <device Dname="STM32F301C6">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="SVD\STM32F301x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F301C8'  ************************** -->
        <device Dname="STM32F301C8">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="SVD\STM32F301x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="QFP"           n="48"/>
          <feature type="CSP"           n="49"/>
          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F301K6'  ************************** -->
        <device Dname="STM32F301K6">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="SVD\STM32F301x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

