t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
        <!-- *************************  Device 'STM32F302C6'  ************************** -->
        <device Dname="STM32F302C6">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302x8"/>
          <debug svd="SVD\STM32F302x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00093333.pdf" title="STM32F302x6 STM32F302x8 Datasheet"/>
          <book name="Documents\DM00109012.pdf" title="STM32F302x6 STM32F302x8 Errata Sheet"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F302C8'  ************************** -->
        <device Dname="STM32F302C8">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302x8"/>
          <debug svd="SVD\STM32F302x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00093333.pdf" title="STM32F302x6 STM32F302x8 Datasheet"/>
          <book name="Documents\DM00109012.pdf" title="STM32F302x6 STM32F302x8 Errata Sheet"/>

          <feature type="QFP"           n="48"/>
          <feature type="CSP"           n="49"/>
          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F302CB'  ************************** -->
        <device Dname="STM32F302CB">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00094064.pdf" title="STM32F302xB STM32F302xC Datasheet"/>
          <book name="Documents\DM00099975.pdf" title="STM32F302xB/C Errata Sheet"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="9"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F302CC'  ************************** -->
        <device Dname="STM32F302CC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00094064.pdf" title="STM32F302xB STM32F302xC Datasheet"/>
          <book name="Documents\DM00099975.pdf" title="STM32F302xB/C Errata Sheet"/>

