t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
        <!-- *************************  Device 'STM32F302RE'  ************************** -->
        <device Dname="STM32F302RE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documents\DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="QFP"           n="64"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F302VB'  ************************** -->
        <device Dname="STM32F302VB">
          <compile header="Device\Include\stm32f3xx.h"  define="STM32F302xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00094064.pdf" title="STM32F302xB STM32F302xC Datasheet"/>
          <book name="Documents\DM00099975.pdf" title="STM32F302xB/C Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="17"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F302VC'  ************************** -->
        <device Dname="STM32F302VC">
          <compile header="Device\Include\stm32f3xx.h"  define="STM32F302xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00094064.pdf" title="STM32F302xB STM32F302xC Datasheet"/>
          <book name="Documents\DM00099975.pdf" title="STM32F302xB/C Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="17"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F302VD'  ************************** -->
        <device Dname="STM32F302VD">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documents\DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="17"      m="12"/>
          <feature type="IOs"           n="86"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F302VE'  ************************** -->
        <device Dname="STM32F302VE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documents\DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="17"      m="12"/>
          <feature type="IOs"           n="86"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

       <!-- **************************  Device 'STM32F302ZD'  ************************** -->
       <device Dname="STM32F302ZD">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documents\DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="QFP"           n="144"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F302ZE'  ************************** -->
        <device Dname="STM32F302ZE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documents\DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="QFP"           n="144"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F303'  **************************** -->
      <subFamily DsubFamily="STM32F303">
        <processor Dclock="72000000"/>

