t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
          <feature type="QFP"           n="64"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F303RB'  ************************** -->
        <device Dname="STM32F303RB">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000A000" init   ="0" default="1"/>
          <memory id="IRAM2"                        start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00058181.pdf" title="STM32F303xB STM32F303xC Datasheet"/>
          <book name="Documents\DM00063985.pdf" title="STM32F303xB/C Errata Sheet"/>

          <feature type="QFP"           n="64"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="IOs"           n="52"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'STM32F303RC'  ************************** -->
        <device Dname="STM32F303RC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xC"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <memory id="IRAM2"                        start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00058181.pdf" title="STM32F303xB STM32F303xC Datasheet"/>
          <book name="Documents\DM00063985.pdf" title="STM32F303xB/C Errata Sheet"/>

          <feature type="QFP"           n="64"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="IOs"           n="52"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

		<!-- *************************  Device 'STM32F303RD'  ************************** -->
        <device Dname="STM32F303RD">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00118585.pdf" title="STM32F303xD STM32F303xE Datasheet"/>
          <book name="Documents\DM00118589.pdf" title="STM32F303xD STM32F303xE Errata Sheet"/>

          <feature type="QFP"           n="64"/>
          <feature type="Timer"         n="10"      m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="IOs"           n="53"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

		<!-- *************************  Device 'STM32F303RE'  ************************** -->
        <device Dname="STM32F303RE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

