t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
          <book name="Documents\DM00118585.pdf" title="STM32F303xD STM32F303xE Datasheet"/>
          <book name="Documents\DM00118589.pdf" title="STM32F303xD STM32F303xE Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
          <feature type="Timer"         n="10"      m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="39"      m="12"/>
          <feature type="IOs"           n="86"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

		<!-- *************************  Device 'STM32F303ZD'  ************************** -->
        <device Dname="STM32F303ZD">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00118585.pdf" title="STM32F303xD STM32F303xE Datasheet"/>
          <book name="Documents\DM00118589.pdf" title="STM32F303xD STM32F303xE Errata Sheet"/>

          <feature type="QFP"           n="144"/>
          <feature type="Timer"         n="10"      m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

		<!-- *************************  Device 'STM32F303ZE'  ************************** -->
        <device Dname="STM32F303ZE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F303xE"/>
          <debug svd="SVD\STM32F303xE.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00118585.pdf" title="STM32F303xD STM32F303xE Datasheet"/>
          <book name="Documents\DM00118589.pdf" title="STM32F303xD STM32F303xE Errata Sheet"/>

          <feature type="QFP"           n="144"/>
          <feature type="Timer"         n="10"      m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="116"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
	  </subFamily>

      <!-- ************************  Subfamily 'STM32F373'  **************************** -->
      <subFamily DsubFamily="STM32F373">
        <processor Dclock="72000000"/>

        <book name="Documents\DM00041563.pdf" title="STM32F37xx Reference Manual"/>
        <book name="Documents\DM00046749.pdf" title="STM32F373xx Datasheet"/>
        <book name="Documents\DM00047037.pdf" title="STM32F373xx Errata Sheet"/>

        <!-- *************************  Device 'STM32F373C8'  ************************** -->
        <device Dname="STM32F373C8">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F373xC"/>
          <debug svd="SVD\STM32F37x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

