t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
        <!-- *************************  Device 'STM32F373VC'  ************************** -->
        <device Dname="STM32F373VC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F373xC"/>
          <debug svd="SVD\STM32F37x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"      m="16"/>
          <feature type="ADC"           n="1"      m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F3x4'  **************************** -->
      <subFamily DsubFamily="STM32F3x4">
        <processor Dclock="72000000"/>

        <book name="Documents\DM00093941.pdf" title="STM32F334xx Reference Manual"/>
        <book name="Documents\DM00097745.pdf" title="STM32F334x4 STM32F334x6 STM32F334x8 Datasheet"/>
        <book name="Documents\DM00115957.pdf" title="STM32F334x4/x6/x8 Errata Sheet"/>

        <!-- *************************  Device 'STM32F334C4'  ************************** -->
        <device Dname="STM32F334C4">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="SVD\STM32F334x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="2"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F334C6'  ************************** -->
        <device Dname="STM32F334C6">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="SVD\STM32F334x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="Timer"         n="1"                   name="High Resolution Timer"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F334C8'  ************************** -->
        <device Dname="STM32F334C8">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="SVD\STM32F334x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

