t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
          <book name="Documents\DM00094350.pdf" title="STM32F301x6/8 and STM32F318x8 Reference Manual"/>
          <book name="Documents\DM00115350.pdf" title="STM32F318C8 STM32F318K8 Datasheet"/>
          <book name="Documents\DM00115238.pdf" title="STM32F318C8 STM32F318K8 Errata Sheet"/>

          <feature type="QFP"           n="32"/>
          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F328C8'  ************************** -->
        <device Dname="STM32F328C8">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F328xx"/>
          <debug svd="SVD\STM32F301x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00004000" startup="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documents\DM00116561.pdf" title="STM32F328C8 Datasheet"/>
          <book name="Documents\DM00117837.pdf" title="STM32F328C8 Errata Sheet"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="2"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F358CC'  ************************** -->
        <device Dname="STM32F358CC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F358xx"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000A000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documents\DM00100431.pdf" title="STM32F358xC Datasheet"/>
          <book name="Documents\DM00099979.pdf" title="STM32F358xC Errata Sheet"/>

          <feature type="QFP"           n="48"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="4"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F358RC'  ************************** -->
        <device Dname="STM32F358RC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F358xx"/>
          <debug svd="SVD\STM32F30x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000A000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documents\DM00100431.pdf" title="STM32F358xC Datasheet"/>
          <book name="Documents\DM00099979.pdf" title="STM32F358xC Errata Sheet"/>

