t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
        <!-- *************************  Device 'STM32F378VC'  ************************** -->
        <device Dname="STM32F378VC">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F378xx"/>
          <debug svd="SVD\STM32F37x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00041563.pdf" title="STM32F37xx Reference Manual"/>
          <book name="Documents\DM00101621.pdf" title="STM32F378xx Datasheet"/>
          <book name="Documents\DM00099952.pdf" title="STM32F378xx Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"      m="16"/>
          <feature type="ADC"           n="1"      m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'STM32F398VE'  ************************** -->
        <device Dname="STM32F398VE">
          <compile header="Device\Include\stm32f3xx.h" define="STM32F398xx"/>
          <debug svd="SVD\STM32F37x.svd"/>
          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash\STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents\DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documents\DM00149412.pdf" title="STM32F398VE Datasheet"/>
          <book name="Documents\DM00150605.pdf" title="STM32F398VE Errata Sheet"/>

          <feature type="QFP"           n="100"/>
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="39"     m="12"/>
          <feature type="IOs"           n="88"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32F301x8 CMSIS">
      <description>STMicroelectronics STM32F301x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F301[CKR][68]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F302x8 CMSIS">
      <description>STMicroelectronics STM32F302x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CKR][68]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F302xC CMSIS">
      <description>STMicroelectronics STM32F302xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CRV][BC]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F302xE CMSIS">
      <description>STMicroelectronics STM32F302xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[RVZ][DE]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F303x8 CMSIS">
      <description>STMicroelectronics STM32F303x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CKR][68]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F303xC CMSIS">
      <description>STMicroelectronics STM32F303xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CRV][BC]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F303xE CMSIS">
      <description>STMicroelectronics STM32F303xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[RVZ][DE]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F373xC CMSIS">
      <description>STMicroelectronics STM32F373xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F373[CRV][8BC]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F334x8 CMSIS">
      <description>STMicroelectronics STM32F334x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F334[CKR][468]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

