t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
    <condition id="STM32F318xx CMSIS">
      <description>STMicroelectronics STM32F318xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F318[CK][8]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F328xx CMSIS">
      <description>STMicroelectronics STM32F328xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F328[C][8]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F358xx CMSIS">
      <description>STMicroelectronics STM32F358xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F358[CRV][C]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F378xx CMSIS">
      <description>STMicroelectronics STM32F378xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F378[CRV][C]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F398xx CMSIS">
      <description>STMicroelectronics STM32F398xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F398[V][E]"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- Startup STM32F301x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F301x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F301x8 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f301x8.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F302x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F302x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F302x8 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f302x8.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F302xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F302xC CMSIS">
      <description>System Startup for STMicroelectronics STM32F302xC Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f302xc.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F302xE -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F302xE CMSIS">
      <description>System Startup for STMicroelectronics STM32F302xE Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f302xe.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F303x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F303x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F303x8 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f303x8.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F303xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F303xC CMSIS">
      <description>System Startup for STMicroelectronics STM32F303xC Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f303xc.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F303xE -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F303xE CMSIS">
      <description>System Startup for STMicroelectronics STM32F303xE Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f303xe.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F373xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F373xC CMSIS">
      <description>System Startup for STMicroelectronics STM32F373xC Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_stm32f373xc.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"        attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

