t21/Walnut_X/Packages/.cache/Keil.STM32F3xx_DFP.1.3.0.pdsc
      <component Cgroup="Graphic LCD" condition="STM32F303xC CMSIS">
        <description>Graphic LCD driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="header"  name="Boards\ST\STM32303C-EVAL\Common\GLCD_Config.h"/>
          <file category="source"  name="Boards\ST\STM32303C-EVAL\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\ST\STM32303C-EVAL\Common\GLCD_SPI_STM32303C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="STM32F303xC CMSIS">
      <description>Button driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32303C-EVAL\Common\Buttons_STM32303C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="STM32F303xC CMSIS">
        <description>LED driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32303C-EVAL\Common\LED_STM32303C-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="STMicroelectronics" name="STM32F3-Discovery" revision="Rev.B.0" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F3DISCOVERY">
      <description>STMicroelectronics STM32F3-Discovery Board</description>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/PF254044" title="STM32F3-Discovery Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F303VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F303"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="LED"       n="10"              name="LEDs: USB COM, 3.3 V Power, 8 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32373C-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32373C-EVAL Board</description>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF252995" title="STM32373C-EVAL Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F373VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F373"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32303C-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32303C-EVAL Board</description>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF252996" title="STM32303C-EVAL Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F303VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F303"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32F3-Discovery Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F3-Discovery\Blinky">
      <description>Blinky example</description>
      <board name="STM32F3-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F3-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F3-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32373C-EVAL Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32373C-EVAL\Blinky">
      <description>Blinky example</description>
      <board name="STM32373C-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32373C-EVAL\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32373C-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32303C-EVAL Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32303C-EVAL\Blinky">
      <description>Blinky example</description>
      <board name="STM32303C-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32303C-EVAL\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32303C-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
